Revit 2024 API
ReinforcementBarOrientation Enumeration
 Describes the bar orientation at Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum ReinforcementBarOrientation
Visual Basic
Public Enumeration ReinforcementBarOrientation
Visual C++
public enum class ReinforcementBarOrientation
Members
Member name | Description
TopOrExterior |  The major segment of the bar is on the top face (of a floor/slab) or the exterior face (of a wall).
NearSide |  The major segment of the bar is on the side edge near to the Path Reinforcement sketch line.
BottomOrInterior |  The major segment of the bar is on the bottom face (of a floor/slab) or the interior face (of a wall).
FarSide |  The major segment of the bar is on the side edge far from the Path Reinforcement sketch line.
See Also
Autodesk.Revit.DB.Structure Namespace